module data.jp;

import types;
import std.conv: to;

uint textAddress = 0x9B1A30;


immutable String_t[] mapping1x2_Base = [
    /// Unmodified base charset & kana  
    "\0", "▶", "「", "」", "✕",  "“",  "·", "⇧", "⇩",  "⇦", "⇨", "♪",  "♥",  "&",  "゛", "゜",
    "あ", "ア", "い", "イ", "う", "を", "え", "エ", "お", "オ", "ぁ", "ァ", "ぃ", "ィ", "ぅ", "ゥ",
    " ",  "!", "\"",  "わ", "ワ", "っ", "ッ", "´",  "(", ")", "、", "。", ",", "-", ".", "ヲ",
    "0",  "1",  "2",  "3",  "4",  "5",  "6",  "7",  "8",  "9", "：", "ぇ", "ェ", "ぉ", "ォ", "？",
    "~",  "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O",
    "P",  "Q",  "R",  "S",  "T",  "U",  "V", "W",  "X", "Y",  "Z",  "ぬ", "や", "ヤ", "ゆ", "ユ",
    "`",  "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o",
    "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "ヌ", "よ", "ヨ", "ん", "ン",

    
    "な", "ナ", "に", "ニ", "ー", "...", "ね", "ネ", "の", "ノ", "ま", "マ", "み", "ミ", "む", "ム",
    "め", "メ", "も", "モ", "ら", "ラ", "り", "リ", "る", "ル", "れ", "レ", "ろ", "ロ", "ゃ", "ャ",
    "ゅ", "ュ", "ょ", "ョ", "ヴ", "が", "ガ", "ぎ", "ギ", "ぐ", "グ", "げ", "ゲ", "ご", "ゴ", "ざ",
    "ザ", "じ", "ジ", "ず", "ズ", "ぜ", "ゼ", "ぞ", "ゾ", "だ", "ダ", "ぢ", "ヂ", "づ", "ヅ", "で",
    "デ", "ど", "ド", "ば", "バ", "び", "ビ", "ぶ", "ブ", "べ", "ベ", "ぼ", "ボ", "ぱ", "パ", "ぴ",
    "ピ", "ぷ", "プ", "ぺ", "ペ", "ぽ", "ポ", "ウ", "か", "カ", "き", "キ", "く", "ク", "け", "ケ",
    "こ", "コ", "さ", "サ", "し", "シ", "す", "ス", "せ", "セ", "そ", "ソ", "た", "タ", "ち", "チ",
    "つ", "ツ", "て", "テ", "と", "ト", "は", "ハ", "ひ", "ヒ", "ふ", "フ", "へ", "ヘ", "ほ", "ホ",
].to!(String_t[]);

immutable String_t[] mapping1x2_0F = [
    /// Punctuation 0F 
    "\0", "▶", "「",  "」", "✕",  "“", "·", "⇧",  "⇩",  "⇦", "⇨",  "♪",  "♥",  "&",  "゛", "゜",
    "#",  "$",  "%",  "*",  "+",  "/",  ";",  "<",  "=",  ">",  "@",  "[",  "¥",  "]",  "^",  "_",
    "{",  "|",  "}",  "‾",  "【", "】", "\0", "\0", "‚",  "\0", "„",  "⋯", "\0", "\0", "\0", "\0",
    "Š",  "<",  "Œ",  "\0", "Ž",  "\0", "\0", "‘",  "’",  "“",  "”",  "·",  "\0", "\0", "\0",  "™",
    "š",  ">",  "œ",  "\0", "ž",  "Ÿ",  "\0", "¡",  "\0", "♪",  "\0", "\0", "\0", "\0", "\0", "\0",
    "ᵃ",  "«",  "\0", "\0", "\0", "\0", "°",  "\0", "\0", "\0", "′",  "\0", "\0", "·",  "\0", "\0",
    "ᵒ",  "»",  "\0", "\0", "\0", "¿",  "À",  "Á",  "Â",  "Ã",  "Ä",  "Å",  "Æ",  "Ç",  "È",  "É",
    "Ê",  "Ë",  "Ì",  "Í",  "Î",  "Ï",  "Ð",  "Ñ",  "Ò",  "Ó",  "Ô",  "Õ",  "Ö",  "×",  "Ø",  "Ù",

    "Ú", "Û", "Ü", "Ý", "Þ", "ß", "à", "á", "â", "ã", "ä", "å", "æ", "ç", "è", "é",
    "ê", "ë", "ì", "í", "î", "ï", "ð", "ñ", "ò", "ó", "ô", "õ", "ö", "÷", "ø", "ù",
    "ú", "û", "ü", "ý", "þ", "ÿ",

    // "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", "　", 
].to!(String_t[]);

immutable String_t[] glyphs2x2 = [
    /// Kanji 0D
    "　", "冒", "険", "者", "洞", "行", "世", "界", 
    "集", "必", "要", "数", "覚", "今", "時", "石", 
    "持", "上", "全", "員", "見", "中", "自", "動", 
    "的", "目", "得", "活", "高", "気", "伝", "蝕", 
    "人", "勇", "出", "木", "実", "知", "赤", "力", 
    "青", "守", "緑", "歩", "速", "段", "階", "押", 
    "一", "度", "投", "使", "体", "別", "剣", "以", 
    "説", "方", "合", "弓", "矢", "息", "町", "何", 

    "道", "大", "弱", "話", "風", "魔", "封", "印", 
    "最", "近", "臣", "変", "感", "心", "配", "言", 
    "強", "暴", "々", "災", "身", "戦", "少", "龍", 
    "用", "王", "断", "無", "礼", "手", "作", "美", 
    "残", "念", "分", "我", "名", "連", "思", "年", 
    "良", "花", "日", "宮", "殿", "助", "小", "姫", 
    "向", "借", "抜", "去", "倒", "先", "住", "妖", 
    "精", "呪", "示", "会", "刻", "入", "真", "開", 

    "画", "面", "右", "下", "早", "立", "進", "前", 
    "受", "落", "長", "羽", "越", "果", "火", "解", 
    "回", "帰", "教", "老", "古", "後", "光", "攻", 
    "恨", "再", "指", "事", "取", "盾", "域", "乗", 
    "森", "聖", "昔", "足", "待", "達", "誰", "弾", 
    "追", "敵", "当", "湖", "持", "倍", "物", "壁", 
    "返", "本", "満", "戻", "役", "神", "数", "応", 
    "図", "専", "湯", "民", "電", "源", "次", "弟", 

    "子", "確", "他", "遊", "消", "氷", "炎", "多", 
    "探", "©",  "®",  "左", "地", "悪", "善", "遠", 
    "低", "水", "東", "西", "南", "北", "紫", "黄", 
    "白", "黒", "岩", "山", "窟", "銀", "金", "川", 
    "空", "海", "城", "色", "同", "部", "引", "両", 
    "点", "法", "穴", "場", "所", "台", "音", "転", 
    "斬", "宝", "箱", "家", "草", "間", "彼", "式", 
    "庭", "国", "武", "術", "智", "平", "苦", "和", 
// ];

// immutable String_t[] glyphs2x2_0E = [
    /// Kanji extra 0E
    "聞", "工", "口", "里", "折", "秘", "技", "優", 
    "勝", "邪", "突", "屋", "原", "店", "主", "現", 
    "女", "牧", "墓", "流", "谷", "闇", "雲", "滝", 
    "娘", "撃", "通", "信", "滅", "続", "兵", "士", 
    "境", "丘", "林",
// ];

// immutable String_t[] glyphs2x2_0C = [
    /// Button symbols 0C      
    "Ⓐ", "Ⓑ", "Ⓛ", "Ⓡ", "⮝", "⮟", "⮜", "⮞",
    "✜",
].to!(String_t[]); 

// immutable String_t[] glyphs2x2 = glyphs2x2_0D~glyphs2x2_0E~glyphs2x2_0C;

import std.algorithm.searching: countUntil;
int mapping_0D = 0;
int mapping_0E = glyphs2x2.countUntil("聞".to!(String_t));
int mapping_0C = glyphs2x2.countUntil("Ⓐ".to!(String_t));

immutable String_t[86] windHylian;


String_t[] tableDescriptions = [
    /// 0
    "Save, quit, and sleep menus.",
    /// 1
    "Game credits.",
    "Names of NPCs.",
    "Hints. Mostly from Tessin.",
    "Item Names.",
    /// 4
    "Item get messages, and signs.",
    "Signposts.",
    "Place names.",
    "Figurine titles.",
    /// 8
    "Figurine descriptions.",
    "Debug messages.",
    ""
].to!(String_t[]);